shubhamdp/connectedhomeip/src/platform/ESP32/ConnectivityManagerImpl_WiFi.cpp
    nanPublishConfig.usd_publish_config.usd_chan_list     = chan_list;
    nanPublishConfig.usd_publish_config.usd_chan_list_len = chan_list_len;

    uint32_t publish_id = esp_wifi_nan_publish_service(&nanPublishConfig, 0);

    // Free memory allocated for WFA SSI
    if (completeWfaSsi != nullptr)
    {
        chip::Platform::MemoryFree(completeWfaSsi);
        completeWfaSsi = nullptr;
    }

    if (publish_id == 0)
    {
        ChipLogError(DeviceLayer, "Publishing to %s failed", nanPublishConfig.service_name);
        return CHIP_ERROR_INTERNAL;
    }

    ChipLogProgress(DeviceLayer, "Publishing to %s with ID %" PRIu32, nanPublishConfig.service_name, publish_id);
    args.publish_id = publish_id;

    WiFiPAFSession sessionInfo  = { .role = WiFiPafRole::kWiFiPafRole_Publisher, .id = publish_id };
    WiFiPAFLayer & WiFiPafLayer = WiFiPAFLayer::GetWiFiPAFLayer();
    CHIP_ERROR err              = WiFiPafLayer.AddPafSession(PafInfoAccess::kAccSessionId, sessionInfo);
    if (err != CHIP_NO_ERROR)
    {
        ChipLogError(DeviceLayer, "Failed to add PAF session, err: %s", chip::ErrorStr(err));
    }
    return err;
}

CHIP_ERROR ConnectivityManagerImpl::_WiFiPAFCancelPublish(uint32_t publishId)
{
    esp_err_t err = esp_wifi_nan_cancel_publish(static_cast<uint8_t>(publishId));
    if (err != ESP_OK)
    {
        ChipLogError(DeviceLayer, "Failed to cancel publish with ID %" PRIu32, publishId);
        return CHIP_ERROR_INTERNAL;
    }
    return CHIP_NO_ERROR;
}

CHIP_ERROR ConnectivityManagerImpl::_WiFiPAFSend(const WiFiPAF::WiFiPAFSession & txInfo, chip::System::PacketBufferHandle && msgBuf)
{
    // TODO: change this to Detail later
    ChipLogProgress(DeviceLayer, "WiFi-PAF: sending PAF Follow-up packets, (%u)", msgBuf->DataLength());
    VerifyOrReturnError(msgBuf.IsNull() == false, CHIP_ERROR_INVALID_ARGUMENT);

    // Ensure outgoing message fits in a single contiguous packet buffer, as currently required by the
    // message fragmentation and reassembly engine.
    if (msgBuf->HasChainedBuffer())
    {
        msgBuf->CompactHead();

        if (msgBuf->HasChainedBuffer())
        {
            ChipLogError(DeviceLayer, "WiFi-PAF: Outbound message too big (%u), skip temporally", msgBuf->DataLength());
            return CHIP_ERROR_OUTBOUND_MESSAGE_TOO_BIG;
        }
    }

    // Get original payload data and size
    const uint8_t * originalPayload   = msgBuf->Start();
    const uint16_t originalPayloadLen = static_cast<uint16_t>(msgBuf->DataLength());

    printf("Original payload: ");
    for (size_t i = 0; i < originalPayloadLen; i++)
    {
        printf("%02X ", originalPayload[i]);
    }
    printf("\n");

    // Create a WFA SSI structure for follow-up messages
    // WFA SSI format: [WFA OUI (3 bytes)] + [Protocol (1 byte)] + [Payload]
    size_t wfaSsiSize        = 3 + 1 + originalPayloadLen;
    uint8_t * completeWfaSsi = static_cast<uint8_t *>(chip::Platform::MemoryAlloc(wfaSsiSize));
    VerifyOrReturnError(completeWfaSsi != nullptr, CHIP_ERROR_NO_MEMORY);

    // Fill in the WFA OUI
    completeWfaSsi[0] = 0x50;
    completeWfaSsi[1] = 0x6F;
    completeWfaSsi[2] = 0x9A;
    // Set the protocol type to CSA MATTER
    completeWfaSsi[3] = WIFI_SVC_PROTO_CSA_MATTER;

    // Copy the payload
    memcpy(completeWfaSsi + 4, originalPayload, originalPayloadLen);

    ChipLogProgress(DeviceLayer, "Created WFA SSI for follow-up with Matter protocol");

    //  Send the packets
    wifi_nan_followup_params_t followupParams = { 0 };

    printf("Sending followup with peer MAC: ");
    for (size_t i = 0; i < sizeof(txInfo.peer_addr); i++)
    {
        printf("%02X ", txInfo.peer_addr[i]);
    }
    printf("\n");

    // We are downsizing but necessary to avoid warnings, we are sure that txInfo.id and txInfo.peer_id are in range of uint8_t
    followupParams.inst_id      = static_cast<uint8_t>(txInfo.id);
    followupParams.peer_inst_id = static_cast<uint8_t>(txInfo.peer_id);
    memcpy(followupParams.peer_mac, txInfo.peer_addr, sizeof(followupParams.peer_mac));
    followupParams.ssi_len = static_cast<uint16_t>(wfaSsiSize);
    followupParams.ssi     = completeWfaSsi;

    esp_err_t err = esp_wifi_nan_send_message(&followupParams);

    // Free the allocated WFA SSI memory
    if (completeWfaSsi != nullptr)
    {
        chip::Platform::MemoryFree(completeWfaSsi);
        completeWfaSsi = nullptr;
    }

    if (err != ESP_OK)
    {
        ChipLogError(DeviceLayer, "Failed to send followup with ID %u, err: %d", followupParams.inst_id, err);
    }
    else
    {
        ChipLogProgress(DeviceLayer, "WiFi-PAF: sent followup with ID %u", followupParams.inst_id);
    }

    ChipDeviceEvent event{ .Type = DeviceEventType::kCHIPoWiFiPAFWriteDone };
    memcpy(&event.CHIPoWiFiPAFReceived.SessionInfo, &txInfo, sizeof(chip::WiFiPAF::WiFiPAFSession));
    event.CHIPoWiFiPAFReceived.result = (err == ESP_OK);
    PlatformMgr().PostEventOrDie(&event);

    return CHIP_NO_ERROR;
}

CHIP_ERROR ConnectivityManagerImpl::_WiFiPAFShutdown(uint32_t id, [[maybe_unused]] WiFiPAF::WiFiPafRole role)
{
    gTransportInitiated = false;
    return _WiFiPAFCancelPublish(id);
}

#endif // CHIP_DEVICE_CONFIG_ENABLE_WIFIPAF

} // namespace DeviceLayer
} // namespace chip

#endif // CHIP_DEVICE_CONFIG_ENABLE_WIFI
